USE whouse;
INSERT INTO commodity VALUES
  (2,'Бур Hitachi 40mm','Бур Hitachi 40mm','шт'),
  (3,'Дюбель 6*40','Дюбель универсальный 6*40','кг'),
  (4,'Манометричний коллектор','Манометричний коллектор','шт'),
  (5,'Трубогиб пружинный 1/4','Трубогиб пружинный 1/4 СТ-102-04','шт'),
  (6,'Трубогиб пружинный 3/8','Трубогиб пружинный 3/8 СТ-102-06','шт'),
  (7,'Труборез 3-16 мм','Труборез CT 127 (3-16 мм)','шт'),
  (8,'Вальцовка дюймовая','Вальцовка СТ-806АМ дюймовая','шт'),
  (9,'Манометрический коллектор 536G ','Манометрический коллектор 536G R-22,12,407+3шланга (90см.) в комплекте Харьков','шт'),
  (10,'хладагентом R22','хладагентом R22.Прикольний','л'),
  (11,'хладагентом R32','хладагентом R32.Круче','шт'),
  (12,'Ізолента чорна','Ізолента чорна','м'),
  (13,'Цвяхи і 100мм','Цвяхи стальні 100мм','кг');

INSERT INTO storage VALUES
  (1,2,12),
  (2,3,13),
  (3,4,5),
  (4,5,6),
  (5,6,44),
  (6,7,66),
  (7,8,16),
  (8,9,18),
  (9,10,44),
  (10,11,3),
  (11,12,11),
  (12,13,10);

INSERT INTO roles VALUES
  (1,'Комірник'),
  (2,'Робочий'),
  (3,'Бухгалтер'),
  (4,'Директор'),
  (5,'Адміністратор');



INSERT INTO users VALUES
  (1,'mind','medusa','Сергій Лесько',5),
  (2,'vitas','bvi','Віктор Бачило',4),
  (3,'buh','buh','Бухгалтер Зіна',3),
  (4,'rob','rob','Робочий Коля',2),
  (5,'kom','kom','Комірник Вася',1);

INSERT INTO flows VALUES
  (1,2,3,10, "Завезені 10 бурів",'2014-05-28 13:11:0'),
  (2,12,4,-1, "Взята ізолента. Замовлення №111",'2014-05-30 11:11:0'),
  (3,13,3,25, "Завезено 25 кг цвяхів",'2014-06-01 17:54:0');




